{
  "_name_or_path": "time_moe_200m",
  "apply_aux_loss": true,
  "architectures": [
    "TimeMoeForPrediction"
  ],
  "auto_map": {
    "AutoConfig": "configuration_time_moe.TimeMoeConfig",
    "AutoModelForCausalLM": "modeling_time_moe.TimeMoeForPrediction"
  },
  "attention_dropout": 0.0,
  "hidden_act": "silu",
  "hidden_size": 768,
  "horizon_lengths": [
    1,
    8,
    32,
    64
  ],
  "initializer_range": 0.02,
  "input_size": 1,
  "intermediate_size": 3072,
  "max_position_embeddings": 4096,
  "model_type": "time_moe",
  "num_attention_heads": 12,
  "num_experts": 8,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 12,
  "num_key_value_heads": 12,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000,
  "router_aux_loss_factor": 0.02,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.1",
  "use_cache": true,
  "use_dense": false
}
